:PROPERTIES:
:ID:       F9BFCD93-FB1A-4EBD-BC89-7B088358E0D4
:END:
#+title: Vanilla Emacs Configuration
#+startup: overview

This is configuration of vanilla Emacs without external packages.  It
is optimised for users of emacs-mac ([[https://github.com/railwaycat/homebrew-emacsmacport][railwaycat/homebrew-emacsmacport]])
that adds macOS-specific goodies.  The configuration is useful to
start using Emacs from scratch having sane defaults.

As of <2024-11-25 Mon> the target Emacs version is Emacs 29.

* Launch Emacs with this configuration
The idea is to tangle Emacs Lisp source code blocks into init.el file
and then launch Emacs.

#+begin_src sh :results silent
open -n /Applications/MacPorts/EmacsMac.app --args -Q
#+end_src



#+begin_src sh :results silent
open -n /Applications/MacPorts/EmacsMac.app --args --init-directory ~/.config/emacs.vanilla
#+end_src

#+caption: recreate emacs.vanilla directory
#+begin_src sh
cd ~/.config
rm -rf emacs.vanilla
mkdir emacs.vanilla
cp ~/Documents/Projects/Dotfiles/early-init.el emacs/vanilla-29.el emacs.vanilla
touch emacs.vanilla/init.el
echo "$(date): emacs.vanilla directory recreated"
#+end_src

#+RESULTS:
: Fri Apr 19 09:40:28 CEST 2024: emacs.vanilla directory recreated

